## Step 1 - Connect

In [1]:
%run ../connect.ipynb

## Step 2 - Question

```
Table: Seat

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| student     | varchar |
+-------------+---------+
id is the primary key column for this table.
Each row of this table indicates the name and the ID of a student.
id is a continuous increment.
 

Write an SQL query to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by id in ascending order.

The query result format is in the following example.

 

Example 1:

Input: 
Seat table:
+----+---------+
| id | student |
+----+---------+
| 1  | Abbot   |
| 2  | Doris   |
| 3  | Emerson |
| 4  | Green   |
| 5  | Jeames  |
+----+---------+
Output: 
+----+---------+
| id | student |
+----+---------+
| 1  | Doris   |
| 2  | Abbot   |
| 3  | Green   |
| 4  | Emerson |
| 5  | Jeames  |
+----+---------+
Explanation: 
Note that if the number of students is odd, there is no need to change the last one's seat.
```

## Step 3 - Insert Data

In [8]:
%%sql
DROP TABLE IF EXISTS Seat;
CREATE TABLE Seat (id int, student varchar(255));
INSERT INTO Seat (id, student) values ('1', 'Abbot');
INSERT INTO Seat (id, student) values ('2', 'Doris');
INSERT INTO Seat (id, student) values ('3', 'Emerson');
INSERT INTO Seat (id, student) values ('4', 'Green');
INSERT INTO Seat (id, student) values ('5', 'Jeames');

Empty DataFrame
Columns: []
Index: []

## Step 4 - Answer

In [10]:
%%sql
SELECT
    (CASE
        WHEN MOD(id, 2) != 0 AND counts != id THEN id + 1
        WHEN MOD(id, 2) != 0 AND counts = id THEN id
        ELSE id - 1
    END) AS id,
    student
FROM
    Seat,
    (SELECT
        COUNT(*) AS counts
    FROM
        Seat) AS seat_counts
ORDER BY id ASC;

   id  student
0   1    Doris
1   2    Abbot
2   3    Green
3   4  Emerson
4   5   Jeames

In [11]:
%%sql
select row_number() over (
        order by (if(id %2 = 1, id + 1, id -1))
    ) as id,
    student
from Seat

   id  student
0   1    Doris
1   2    Abbot
2   3    Green
3   4  Emerson
4   5   Jeames